richvies/CoolEase/old/stm32l051c8t6_rfm/CubeMX/Hub/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SIM_RESET_Pin GPIO_PIN_4
#define SIM_RESET_GPIO_Port GPIOA
#define RF_RESET_Pin GPIO_PIN_6
#define RF_RESET_GPIO_Port GPIOA
#define RF_IO0_Pin GPIO_PIN_7
#define RF_IO0_GPIO_Port GPIOA
#define RF_IO1_Pin GPIO_PIN_0
#define RF_IO1_GPIO_Port GPIOB
#define RF_IO2_Pin GPIO_PIN_1
#define RF_IO2_GPIO_Port GPIOB
#define RF_IO3_Pin GPIO_PIN_2
#define RF_IO3_GPIO_Port GPIOB
#define RF_IO4_Pin GPIO_PIN_10
#define RF_IO4_GPIO_Port GPIOB
#define RF_IO5_Pin GPIO_PIN_11
#define RF_IO5_GPIO_Port GPIOB
#define SPI2_SS_Pin GPIO_PIN_12
#define SPI2_SS_GPIO_Port GPIOB
#define SPI1_SS_Pin GPIO_PIN_6
#define SPI1_SS_GPIO_Port GPIOB
#define STATUS_LED_Pin GPIO_PIN_9
#define STATUS_LED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
